In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
index = pd.date_range('1/1/2000', periods = 8)
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [31]:
s = pd.Series(np.random.randn(5), index = ['a', 'b', 'c', 'd', 'e'])
s

a   -0.158072
b    0.369503
c   -0.098476
d   -1.153623
e    1.448129
dtype: float64

In [10]:
df = pd.DataFrame(np.random.randn(8, 3), index = index, columns = ['A', 'B', 'C'])
df

                   A         B         C
2000-01-01 -2.133923 -1.544006 -0.849869
2000-01-02  0.435817 -0.320399 -0.068283
2000-01-03 -1.244276 -0.845967 -0.554458
2000-01-04 -0.054309  0.825108 -0.766603
2000-01-05 -2.601061 -1.475253  0.667139
2000-01-06  0.644210  0.097346  1.216235
2000-01-07 -1.810675  0.398410 -0.407553
2000-01-08  0.368025  0.512203  0.954557

In [11]:
# head and tail

In [12]:
long_series = pd.Series(np.random.randn(1000))

In [13]:
long_series.head()

0    0.465272
1   -1.000596
2    0.151398
3   -0.645770
4   -0.796719
dtype: float64

In [14]:
long_series.head(3)

0    0.465272
1   -1.000596
2    0.151398
dtype: float64

In [15]:
long_series.tail(3)

997    1.041284
998   -0.271235
999   -1.162980
dtype: float64

In [16]:
# 数据与底层数据

In [17]:
df[:2]

                   A         B         C
2000-01-01 -2.133923 -1.544006 -0.849869
2000-01-02  0.435817 -0.320399 -0.068283

In [18]:
df.columns = [x.lower() for x in df.columns]

In [19]:
df

                   a         b         c
2000-01-01 -2.133923 -1.544006 -0.849869
2000-01-02  0.435817 -0.320399 -0.068283
2000-01-03 -1.244276 -0.845967 -0.554458
2000-01-04 -0.054309  0.825108 -0.766603
2000-01-05 -2.601061 -1.475253  0.667139
2000-01-06  0.644210  0.097346  1.216235
2000-01-07 -1.810675  0.398410 -0.407553
2000-01-08  0.368025  0.512203  0.954557

In [21]:
s.array

<PandasArray>
[-1.5538029763368317, -0.7282988424407929,  0.0899968806305735,
  0.7669263746215599, -0.4201736470183711]
Length: 5, dtype: float64

In [25]:
s.index.array

<PandasArray>
['a', 'b', 'c', 'd', 'e']
Length: 5, dtype: object

ser =

In [26]:
ser = pd.Series(pd.date_range('2000', periods = 2, tz = 'CET'))
ser.to_numpy(dtype = object)

array([Timestamp('2000-01-01 00:00:00+0100', tz='CET', freq='D'),
       Timestamp('2000-01-02 00:00:00+0100', tz='CET', freq='D')],
      dtype=object)

In [27]:
ser.to_numpy(dtype = 'datetime64[ns]')

array(['1999-12-31T23:00:00.000000000', '2000-01-01T23:00:00.000000000'],
      dtype='datetime64[ns]')

In [28]:
df.to_numpy()

array([[-2.13392286, -1.54400635, -0.84986884],
       [ 0.43581732, -0.32039935, -0.0682827 ],
       [-1.24427611, -0.84596723, -0.55445843],
       [-0.05430938,  0.8251076 , -0.76660254],
       [-2.60106134, -1.47525273,  0.66713862],
       [ 0.64420992,  0.0973455 ,  1.21623487],
       [-1.81067482,  0.39840996, -0.4075528 ],
       [ 0.36802519,  0.51220277,  0.95455653]])

In [29]:
# 匹配/广播机制

In [34]:
df = pd.DataFrame({
    'one': pd.Series(np.random.randn(3), index = ['a', 'b', 'c']), 
    'two': pd.Series(np.random.randn(4), index = ['a', 'b', 'c', 'd']), 
    'three': pd.Series(np.random.randn(3), index = ['a', 'b', 'c'])
})
df

        one       two     three
a  1.101812 -1.411107 -0.499020
b -1.964482 -1.324718  2.677969
c  0.251673  0.753125  0.118156
d       NaN -1.587659       NaN

In [37]:
row = df.iloc[1]

In [40]:
column = df['two']

In [41]:
df.sub(row, axis = 'columns')

        one       two     three
a  3.066294 -0.086390 -3.176990
b  0.000000  0.000000  0.000000
c  2.216155  2.077843 -2.559813
d       NaN -0.262941       NaN

In [42]:
df.sub(row, axis = 1)

        one       two     three
a  3.066294 -0.086390 -3.176990
b  0.000000  0.000000  0.000000
c  2.216155  2.077843 -2.559813
d       NaN -0.262941       NaN

In [45]:
df.sub(column, axis = 'index')

        one  two     three
a  2.512919  0.0  0.912087
b -0.639764  0.0  4.002687
c -0.501452  0.0 -0.634969
d       NaN  0.0       NaN

In [46]:
df.sub(column, axis = 0)

        one  two     three
a  2.512919  0.0  0.912087
b -0.639764  0.0  4.002687
c -0.501452  0.0 -0.634969
d       NaN  0.0       NaN

In [47]:
dfmi = df.copy()